export const posts = {
  posts: [
    {
      id: "post-101",
      title: "Топ 5 сортов кофе для кодинга",
      shortDescription:
        "Краткий обзор зерен, которые помогут не уснуть над багами.",
      content:
        "Полный текст статьи о том, как кофеин влияет на нейронные связи программиста...",
      blogId: "blog-001",
      blogName: "Код и Кофе",
    },
    {
      id: "post-102",
      title: "Как внедрить дизайн-систему",
      shortDescription: "Пошаговый гайд по переезду на единые компоненты.",
      content:
        "В этой статье мы разберем основные этапы создания UI-библиотеки с нуля...",
      blogId: "blog-002",
      blogName: "Дизайн-Системы 101",
    },
    {
      id: "post-103",
      title: "Чистый код: меньше — значит больше",
      shortDescription: "Почему удаление кода — это тоже разработка.",
      content:
        "Многие думают, что продуктивность измеряется строчками кода, но на самом деле...",
      blogId: "blog-003",
      blogName: "Минималист",
    },
  ],
};
